src/fragments/posts/jul_28_2025.html
<div id="outline-container-org076f0a3" class="outline-2">
<h2 id="org076f0a3">What have I been up to?</h2>
<div class="outline-text-2" id="text-org076f0a3">
<p>
Whoops! I missed this month's update by a <i>long</i> shot, but I still want to get it out there before the end of the month.
</p>

<p>
This month was busy busy. I released <a href="https://github.com/miracle-wm-org/miracle-wm/releases/tag/v0.6.0">v0.6.0 of miracle-wm</a> which adds a bunch of new features, go and check it out if you haven't already! I am nearly finished with the sway/i3 IPC support and have big plans to wrap that up before the middle of August. There really isn't much more to go on that front so I might as well close that chapter. On top of that, the more interesting features of miracle that I have planned (e.g. some built-in shell integrations) are motivating me to wrap up the boring parts first.
</p>

<p>
Aside from miracle, I've continued to land a bunch of things in Mir recently around accessibility. The magnifier work is finally done, so go check that out if you use that feature in your day-to-day! I also did a <i>ton of work</i> to fix screenshooting on rotated displays. We were ignoring <a href="https://wayland.app/protocols/wayland#wl_surface:request:set_buffer_transform">wl<sub>surface</sub>::set<sub>buffer</sub><sub>transform</sub></a> in a big way. Now that we're not doing that, your screenshots should like perfect every time!
</p>

<p>
Last but not least, the team has been making waves implementing multi-window in the Flutter toolkit. That's some really interesting and exciting work, so stay tuned for that if you're a Flutter developer!
</p>

<p>
That's all I got! I will make another post shortly, maybe once miracle v0.7.0 is out. Have a great rest of your summer/winter 🪐
</p>
</div>
</div>
